{
  "traveling": "A player who receives the ball while standing still may pivot, using either foot as the pivot foot. Once established, the pivot foot may not be lifted before the ball is released on a pass or shot. If a player jumps with the ball, they must release it before landing. A traveling violation occurs when a player holding the ball moves one or both feet illegally. Players who gather the ball while moving are allowed to take two steps before shooting, passing, or dribbling.",
  
  "double dribble": "Double dribble is a violation that occurs when a player dribbles the ball with both hands simultaneously or when a player picks up the dribble and then dribbles again without passing or shooting. Once a player has ended their dribble by catching or stopping the ball with one or both hands, they cannot begin a new dribble. Violation results in a turnover.",
  
  "shot clock": "The shot clock in the NBA is 24 seconds. Teams must attempt a shot that hits the rim before the shot clock expires, or they lose possession. The shot clock resets to 14 seconds in certain situations, such as offensive rebounds, certain fouls by the defense that don't result in free throws, and defensive loose ball fouls during a limited window in the shot clock. A full 24-second reset occurs after a change of possession or when the ball hits the rim and is recovered by the defense.",
  
  "three-second rule": "The three-second rule prohibits offensive players from remaining in the restricted area (the paint) for more than three consecutive seconds while their team has the ball. There is also a defensive three-second rule that prevents defenders from staying in the paint for more than three seconds unless they are actively guarding an opponent. The count resets when a shot is attempted or possession changes. Violation results in a turnover for offensive violations and a technical free throw for defensive violations.",
  
  "goaltending": "Goaltending is touching the ball on its downward flight toward the basket, or after it has touched the backboard while the ball is above the rim level. This results in the basket being counted if committed by the defense, or a violation if committed by the offense. Goaltending also occurs when a player touches the ball while any part of it is above the cylinder or touches the rim of the basket.",
  
  "personal foul": "A personal foul is illegal physical contact that occurs with an opponent. A player cannot push, hold, charge into, impede the progress of an opponent by extending an arm or shoulder, or use any rough tactics. Players are allowed 6 personal fouls in a game before fouling out. Common types include blocking, charging, holding, pushing, and hand-checking fouls. Non-shooting fouls result in side-outs unless the team is in the bonus.",
  
  "technical foul": "A technical foul is a violation of the rules that does not involve physical contact during gameplay. It can be called for unsportsmanlike conduct, excessive complaining, delay of game, or various procedural issues. Players and coaches receive an automatic ejection upon receiving their second technical foul in a game. Technical fouls result in one free throw for the opposing team and possession of the ball. Players can be suspended after accumulating a certain number of technical fouls in a season.",
  
  "flagrant foul": "A flagrant foul is unnecessary and/or excessive contact committed by a player against an opponent. Flagrant fouls are categorized as either Flagrant 1 (unnecessary contact) or Flagrant 2 (unnecessary and excessive contact), with the latter resulting in automatic ejection. Both types result in free throws and possession for the fouled team. Flagrant fouls are subject to review by officials using replay. Players accumulating a certain number of flagrant foul points during the season may face suspension.",
  
  "clear path foul": "A clear path foul occurs when a defender fouls an offensive player who has a clear path to the basket without any defenders between them and the basket. This results in two free throws and possession of the ball. To qualify as a clear path foul, the offensive player must have control of the ball or be about to receive a pass, be moving toward the basket, and there must be no defender ahead of the player with the ball.",
  
  "backcourt violation": "Once the offensive team gets the ball over the half-court line, they cannot bring it back across the line. If they do, it's a backcourt violation and the defending team gets possession. A player cannot be the first to touch the ball in the backcourt after it has been in the frontcourt unless the defense last touched it. This violation does not apply during jump balls, throw-ins, or after a defensive team bats the ball into the backcourt.",
  
  "offensive interference": "Offensive interference occurs when an offensive player touches the ball while it is on or in the cylinder above the rim, or touches the ball when it is above the rim during a shot attempt. This results in a violation and loss of possession. Players may not touch the ball, the rim, or the net while the ball is on the rim, or reach through the basket from below to touch the ball.",
  
  "defensive three-second rule": "A defensive player cannot remain in the restricted area (the paint) for more than three consecutive seconds unless they are actively guarding an opponent. Violation results in a technical foul with one free throw awarded to the offensive team. The count restarts when the player leaves and re-enters the restricted area, or when they actively guard an opponent. This rule was implemented to prevent zone defenses that crowd the paint.",
  
  "out of bounds": "The ball is out of bounds when it touches a player who is out of bounds, or any other person, the floor, or any object on, above, or outside a boundary line. The team that did not touch the ball last before it went out of bounds gets possession. For the player handling the ball, they are out of bounds when they touch the floor or any object on or outside a boundary line. The lines themselves are considered out of bounds.",
  
  "inbounding": "When inbounding the ball, the player must release the ball within 5 seconds. They cannot step on or over the boundary line while possessing the ball. No other player may cross the boundary line while the ball is being inbounded. The inbounder cannot pass the ball directly back to themselves. After a made basket in the last two minutes of the fourth quarter or overtime, teams may call a timeout and inbound from the frontcourt.",
  
  "jump ball": "A jump ball occurs at the beginning of the game and each overtime period, as well as in certain situations when possession is unclear. The referee tosses the ball between two opposing players who may tap it to teammates. Players not jumping must remain outside the circle until the ball is tapped. If the ball is not tapped by either of the jumpers, the jump ball is repeated. After the initial jump ball to start the game, most jump ball situations are resolved using the alternating possession rule.",
  
  "free throws": "Free throws are awarded after certain fouls. The player must shoot within 10 seconds of receiving the ball and cannot cross the free throw line until the ball touches the rim. Other players cannot enter the lane until the ball leaves the shooter's hands. Players occupying the designated lane spaces may enter the lane once the ball is released, but the shooter and players behind the three-point line must remain outside until the ball hits the rim. Free throws are worth one point each.",
  
  "coach's challenge": "Each team is allowed one coach's challenge per game, which they retain if successful. Coaches can challenge called fouls, out-of-bounds decisions, goaltending, and basket interference calls in the last two minutes of the fourth quarter and overtime. To initiate a challenge, the coach must call a timeout and immediately signal to the officials. Clear and conclusive visual evidence is required to overturn the original call.",
  
  "timeout rules": "Each team has seven timeouts per game, with a maximum of four in the fourth quarter. Timeouts can be either 60 seconds (full) or 20 seconds (short). Teams are limited to two timeouts in the final two minutes of the fourth quarter. A coach or player can call a timeout, but only when their team has possession of the ball or during a dead ball situation. Excessive timeouts result in a technical foul.",
  
  "basket interference": "Basket interference occurs when a player touches the ball or the basket when the ball is on the rim. It also includes touching the ball while it is in the imaginary cylinder above the rim. When committed by the defense, the points are awarded; when committed by the offense, no points are scored and possession changes. This rule is similar to goaltending but specifically refers to when the ball is on or within the cylinder above the rim.",
  
  "hand checking": "Hand checking is illegal contact with an opponent using the hand or forearm, which impedes the progress of the player with the ball. This was strictly enforced beginning in the 2004-05 season to promote more offensive freedom of movement. A defender may not place and keep their hand on an opponent unless they are actively dribbling, setting a screen, or posting up. Violation results in a personal foul.",
  
  "illegal screens": "An illegal screen or pick occurs when an offensive player fails to establish a stationary position before contact, or extends their hips, legs, or arms when setting a screen. The screener must allow the defender a reasonable opportunity to avoid contact. Moving screens, leaning into the defender, or holding/grabbing during a screen are violations that result in an offensive foul.",
  
  "carrying": "Carrying (also called palming) is a violation that occurs when a player pauses while dribbling and allows the ball to come to rest in their hand, then continues to dribble. It also includes turning the hand to face upward while dribbling. Carrying is a form of illegal dribble that results in a turnover. This rule is sometimes inconsistently enforced at the professional level.",
  
  "kick ball": "A kick ball violation occurs when a player intentionally kicks or strikes the ball with any part of the leg or foot. Unintentional contact with the foot or leg is not a violation. When a kick ball is called, the offensive team retains possession and the shot clock is not reset unless it shows less than 14 seconds, in which case it is reset to 14 seconds.",
  
  "eight-second rule": "The offensive team has 8 seconds to advance the ball from their backcourt to the frontcourt. Failure to do so results in a turnover. The count starts when a player gains possession in the backcourt and stops when the ball touches the frontcourt or a player with possession of the ball has both feet in the frontcourt. The count restarts after certain stoppages such as out-of-bounds, fouls, or jump balls awarded to the same team.",
  
  "five-second rule": "A player who is closely guarded (within 6 feet) must pass, shoot, or dribble the ball within five seconds. Failure to do so results in a turnover. This rule only applies when a player is holding the ball, not while dribbling. There is also a separate five-second rule for inbounding the ball after a dead ball situation.",
  
  "delay of game": "Delay of game is called when a player or team intentionally or unintentionally prevents the game from continuing promptly. Examples include touching the ball after a made basket, preventing quick inbounds, not being ready to play after a timeout, or excessive timeout requests. The first offense is a warning, and subsequent offenses result in a technical foul.",
  
  "lane violations": "During free throws, players must remain in their designated positions until the ball leaves the shooter's hands. Defensive players in the first lane spaces can enter after the ball leaves the shooter's hands, while offensive players must remain outside until the ball hits the rim. The shooter cannot cross the free throw line until the ball touches the rim. Violation by the defense during a made free throw is ignored; during a miss, the shooter gets a replacement shot. Violation by the offense during a made free throw nullifies the point.",
  
  "restricted area": "The restricted area is the marked arc located below the basket. A defensive player cannot take a charge in this area - any contact initiated by an offensive player with a defender standing in the restricted area will be called a blocking foul against the defender. This rule does not apply to secondary defenders who jump to block a shot. The restricted area extends 4 feet from the center of the basket."
}